# Importing necessary dataset

In [1]:
import pandas as pd
import numpy as np
import glob

## Importing all 15 csv files

In [2]:
file_path = r'G:\DataScience\Data Insight\NAICS\csv_files'
all_csv_files = glob.glob(file_path + '/*.csv')

csv_list = []

for csv_file in all_csv_files:
    combined_dataframe = pd.read_csv(csv_file, index_col = None, header = 0)
    csv_list.append(combined_dataframe)
    
data = pd.concat(csv_list, axis = 0, ignore_index = True)
data

,SYEAR,SMTH,NAICS,_EMPLOYMENT_
0,2000,1,Accommodation and food services [72],148000
1,2000,1,"Administrative and support, waste management a...",59250
2,2000,1,"Agriculture, forestry, fishing and hunting [11]",61750
3,2000,1,"Arts, entertainment and recreation [71]",39500
4,2000,1,Construction [23],106250
...,...,...,...,...
119179,1999,12,9111,2250
119180,1999,12,9120,28500
119181,1999,12,9130,30250
119182,1999,12,9141,500
119183,1999,12,9191,750

In [3]:
#data[['SYEAR', 'SMTH']] = data[['SYEAR', 'SMTH']].astype(object) 
#print(data.dtypes)

## Getting *Postal service, couriers and messengers* from Postal service[491] & Couriers and messengers[492]

In [4]:
Couriers_and_messengers = data.loc[data['NAICS'].str.contains('492', na = False)]
Couriers_and_messengers

       SYEAR  SMTH                         NAICS  _EMPLOYMENT_
5489    2000     1  Couriers and messengers[492]         10000
5591    2000     2  Couriers and messengers[492]          9250
5693    2000     3  Couriers and messengers[492]          9750
5795    2000     4  Couriers and messengers[492]          7250
5897    2000     5  Couriers and messengers[492]          7250
...      ...   ...                           ...           ...
33114   1999     8  Couriers and messengers[492]          9500
33217   1999     9  Couriers and messengers[492]         11000
33320   1999    10  Couriers and messengers[492]         12750
33423   1999    11  Couriers and messengers[492]         10000
33526   1999    12  Couriers and messengers[492]         12000

[276 rows x 4 columns]

In [5]:
Postal_service = data.loc[data['NAICS'].str.contains('491', na = False)]
Postal_service

       SYEAR  SMTH                NAICS  _EMPLOYMENT_
5543    2000     1  Postal service[491]          9750
5645    2000     2  Postal service[491]          8750
5747    2000     3  Postal service[491]          8250
5849    2000     4  Postal service[491]          7500
5951    2000     5  Postal service[491]          9750
...      ...   ...                  ...           ...
33169   1999     8  Postal service[491]          6750
33272   1999     9  Postal service[491]          7500
33375   1999    10  Postal service[491]          8000
33478   1999    11  Postal service[491]          6750
33581   1999    12  Postal service[491]          7000

[276 rows x 4 columns]

In [6]:
Postal_service_couriers_and_messengers = pd.concat([Postal_service, Couriers_and_messengers])
Postal_service_couriers_and_messengers

       SYEAR  SMTH                         NAICS  _EMPLOYMENT_
5543    2000     1           Postal service[491]          9750
5645    2000     2           Postal service[491]          8750
5747    2000     3           Postal service[491]          8250
5849    2000     4           Postal service[491]          7500
5951    2000     5           Postal service[491]          9750
...      ...   ...                           ...           ...
33114   1999     8  Couriers and messengers[492]          9500
33217   1999     9  Couriers and messengers[492]         11000
33320   1999    10  Couriers and messengers[492]         12750
33423   1999    11  Couriers and messengers[492]         10000
33526   1999    12  Couriers and messengers[492]         12000

[552 rows x 4 columns]

### Changing all names of the NACIS column to *Postal service, couriers and messengers*

After changing all column names to *Postal service, couriers and messengers*, the dataframe was sorted by the **SYEAR and SMTH** columns. Then, the *Employment* column was segregated to add up consecutives even rows to get the sum of empoyments from both [491] and [492].

After that, the dataframe was merged back and the columns names were changed to reflect *Data Output Template*.

In [7]:
Postal_service_couriers_and_messengers = Postal_service_couriers_and_messengers.replace(
    'Postal service[491]', 'Postal service, couriers and messengers')
Postal_service_couriers_and_messengers = Postal_service_couriers_and_messengers.replace(
    'Couriers and messengers[492]', 'Postal service, couriers and messengers')
Postal_service_couriers_and_messengers

       SYEAR  SMTH                                    NAICS  _EMPLOYMENT_
5543    2000     1  Postal service, couriers and messengers          9750
5645    2000     2  Postal service, couriers and messengers          8750
5747    2000     3  Postal service, couriers and messengers          8250
5849    2000     4  Postal service, couriers and messengers          7500
5951    2000     5  Postal service, couriers and messengers          9750
...      ...   ...                                      ...           ...
33114   1999     8  Postal service, couriers and messengers          9500
33217   1999     9  Postal service, couriers and messengers         11000
33320   1999    10  Postal service, couriers and messengers         12750
33423   1999    11  Postal service, couriers and messengers         10000
33526   1999    12  Postal service, couriers and messengers         12000

[552 rows x 4 columns]

In [8]:
df1 = Postal_service_couriers_and_messengers.sort_values(['SYEAR', 'SMTH'])
df1.head(50)

       SYEAR  SMTH                                    NAICS  _EMPLOYMENT_
29976   1997     1  Postal service, couriers and messengers          8000
29921   1997     1  Postal service, couriers and messengers          8250
30079   1997     2  Postal service, couriers and messengers          8000
30024   1997     2  Postal service, couriers and messengers          9000
30182   1997     3  Postal service, couriers and messengers          7750
30127   1997     3  Postal service, couriers and messengers          7500
30285   1997     4  Postal service, couriers and messengers          8500
30230   1997     4  Postal service, couriers and messengers          6000
30388   1997     5  Postal service, couriers and messengers          7500
30333   1997     5  Postal service, couriers and messengers          7500
30491   1997     6  Postal service, couriers and messengers          7750
30436   1997     6  Postal service, couriers and messengers          7750
30594   1997     7  Postal service, couriers and messengers          9000
30539   1997     7  Postal service, couriers and messengers          7750
30697   1997     8  Postal service, couriers and messengers          8250
30642   1997     8  Postal service, couriers and messengers         11500
30800   1997     9  Postal service, couriers and messengers          7750
30745   1997     9  Postal service, couriers and messengers         10750
30903   1997    10  Postal service, couriers and messengers          7000
30848   1997    10  Postal service, couriers and messengers         12250
31006   1997    11  Postal service, couriers and messengers          6500
30951   1997    11  Postal service, couriers and messengers         11750
31109   1997    12  Postal service, couriers and messengers          9000
31054   1997    12  Postal service, couriers and messengers         11250
31212   1998     1  Postal service, couriers and messengers          7500
31157   1998     1  Postal service, couriers and messengers          8500
31315   1998     2  Postal service, couriers and messengers          7250
31260   1998     2  Postal service, couriers and messengers          7250
31418   1998     3  Postal service, couriers and messengers          8250
31363   1998     3  Postal service, couriers and messengers          6250
31521   1998     4  Postal service, couriers and messengers          9750
31466   1998     4  Postal service, couriers and messengers          5750
31624   1998     5  Postal service, couriers and messengers          9250
31569   1998     5  Postal service, couriers and messengers          9500
31727   1998     6  Postal service, couriers and messengers          9000
31672   1998     6  Postal service, couriers and messengers         10250
31830   1998     7  Postal service, couriers and messengers          9250
31775   1998     7  Postal service, couriers and messengers          8250
31933   1998     8  Postal service, couriers and messengers          9250
31878   1998     8  Postal service, couriers and messengers          6500
32036   1998     9  Postal service, couriers and messengers         11500
31981   1998     9  Postal service, couriers and messengers          7750
32139   1998    10  Postal service, couriers and messengers          9750
32084   1998    10  Postal service, couriers and messengers          8500
32242   1998    11  Postal service, couriers and messengers         10750
32187   1998    11  Postal service, couriers and messengers          8500
32345   1998    12  Postal service, couriers and messengers          8750
32290   1998    12  Postal service, couriers and messengers         10750
32448   1999     1  Postal service, couriers and messengers          9000
32393   1999     1  Postal service, couriers and messengers         10250

In [9]:
df = df1.drop(['SYEAR', 'SMTH', 'NAICS'], axis = 1)
df

       _EMPLOYMENT_
29976          8000
29921          8250
30079          8000
30024          9000
30182          7750
...             ...
29618             0
29772             0
29719             0
29873             0
29820             0

[552 rows x 1 columns]

In [10]:
df.index = np.arange(1,len(df)+1)
df = df.reset_index()
df

     index  _EMPLOYMENT_
0        1          8000
1        2          8250
2        3          8000
3        4          9000
4        5          7750
..     ...           ...
547    548             0
548    549             0
549    550             0
550    551             0
551    552             0

[552 rows x 2 columns]

In [11]:
df = df.set_index('index')
df_odd = df.loc[df.index.values % 2 == 1]
df_even = df.loc[df.index.values % 2 == 0]
df_even = df_even.set_index(df_even.index.values - 1)
new = df_odd.add(df_even, fill_value = 0)
new = new.reset_index().reset_index()
new

     level_0  index  _EMPLOYMENT_
0          0      1         16250
1          1      3         17000
2          2      5         15250
3          3      7         14500
4          4      9         15000
..       ...    ...           ...
271      271    543         21250
272      272    545         19000
273      273    547             0
274      274    549             0
275      275    551             0

[276 rows x 3 columns]

In [12]:
df2 = df1[np.arange(len(df)) % 2 == 0]
df2 = df2.reset_index().reset_index()
df2

,level_0,index,SYEAR,SMTH,NAICS,_EMPLOYMENT_
0,0,29976,1997,1,"Postal service, couriers and messengers",8000
1,1,30079,1997,2,"Postal service, couriers and messengers",8000
2,2,30182,1997,3,"Postal service, couriers and messengers",7750
3,3,30285,1997,4,"Postal service, couriers and messengers",8500
4,4,30388,1997,5,"Postal service, couriers and messengers",7500
...,...,...,...,...,...,...
271,271,29469,2019,8,"Postal service, couriers and messengers",9750
272,272,29570,2019,9,"Postal service, couriers and messengers",9750
273,273,29671,2019,10,"Postal service, couriers and messengers",0
274,274,29772,2019,11,"Postal service, couriers and messengers",0
275,275,29873,2019,12,"Postal service, couriers and messengers",0

In [13]:
df3 = pd.merge(df2, new, how = 'inner', on = 'level_0')
df3 = df3.drop(['level_0', 'index_x', '_EMPLOYMENT__x', 'index_y'], axis = 1)
df3.columns = ['SYEAR', 'SMTH', 'LMO_Detailed_Industry', 'Employment']
Postal_service_couriers_and_messengers = df3
Postal_service_couriers_and_messengers.tail(30)

     SYEAR  SMTH                    LMO_Detailed_Industry  Employment
246   2017     7  Postal service, couriers and messengers       16250
247   2017     8  Postal service, couriers and messengers       15250
248   2017     9  Postal service, couriers and messengers       10000
249   2017    10  Postal service, couriers and messengers       13500
250   2017    11  Postal service, couriers and messengers       12250
251   2017    12  Postal service, couriers and messengers       16750
252   2018     1  Postal service, couriers and messengers       11750
253   2018     2  Postal service, couriers and messengers       13750
254   2018     3  Postal service, couriers and messengers       14000
255   2018     4  Postal service, couriers and messengers       15500
256   2018     5  Postal service, couriers and messengers       15250
257   2018     6  Postal service, couriers and messengers       13750
258   2018     7  Postal service, couriers and messengers       18500
259   2018     8  Postal service, couriers and messengers       18500
260   2018     9  Postal service, couriers and messengers       17000
261   2018    10  Postal service, couriers and messengers       17000
262   2018    11  Postal service, couriers and messengers       19250
263   2018    12  Postal service, couriers and messengers       18500
264   2019     1  Postal service, couriers and messengers       24500
265   2019     2  Postal service, couriers and messengers       28000
266   2019     3  Postal service, couriers and messengers       32500
267   2019     4  Postal service, couriers and messengers       33250
268   2019     5  Postal service, couriers and messengers       27000
269   2019     6  Postal service, couriers and messengers       22750
270   2019     7  Postal service, couriers and messengers       23250
271   2019     8  Postal service, couriers and messengers       21250
272   2019     9  Postal service, couriers and messengers       19000
273   2019    10  Postal service, couriers and messengers           0
274   2019    11  Postal service, couriers and messengers           0
275   2019    12  Postal service, couriers and messengers           0

## Getting *Farms* from Crop production[111] & Animal production and aquaculture[112]

In [14]:
Crop_Production = data.loc[data['NAICS'].str.contains('111', na = False)]
Crop_Production

       SYEAR  SMTH                 NAICS  _EMPLOYMENT_
5491    2000     1  Crop production[111]         11250
5593    2000     2  Crop production[111]         10250
5695    2000     3  Crop production[111]         13500
5797    2000     4  Crop production[111]         17000
5899    2000     5  Crop production[111]         21000
...      ...   ...                   ...           ...
33116   1999     8  Crop production[111]         20250
33219   1999     9  Crop production[111]         19500
33322   1999    10  Crop production[111]         17000
33425   1999    11  Crop production[111]         13000
33528   1999    12  Crop production[111]          9500

[276 rows x 4 columns]

In [15]:
Animal_production_and_aquaculture = data.loc[data['NAICS'].str.contains('112', na = False)]
Animal_production_and_aquaculture

       SYEAR  SMTH                                   NAICS  _EMPLOYMENT_
5478    2000     1  Animal production and aquaculture[112]         12250
5580    2000     2  Animal production and aquaculture[112]         12000
5682    2000     3  Animal production and aquaculture[112]         10500
5784    2000     4  Animal production and aquaculture[112]          7500
5886    2000     5  Animal production and aquaculture[112]          8500
...      ...   ...                                     ...           ...
33103   1999     8  Animal production and aquaculture[112]         11500
33206   1999     9  Animal production and aquaculture[112]         11500
33309   1999    10  Animal production and aquaculture[112]         11500
33412   1999    11  Animal production and aquaculture[112]         14000
33515   1999    12  Animal production and aquaculture[112]         11000

[276 rows x 4 columns]

In [16]:
Farms = pd.concat([Crop_Production, Animal_production_and_aquaculture])
Farms

       SYEAR  SMTH                                   NAICS  _EMPLOYMENT_
5491    2000     1                    Crop production[111]         11250
5593    2000     2                    Crop production[111]         10250
5695    2000     3                    Crop production[111]         13500
5797    2000     4                    Crop production[111]         17000
5899    2000     5                    Crop production[111]         21000
...      ...   ...                                     ...           ...
33103   1999     8  Animal production and aquaculture[112]         11500
33206   1999     9  Animal production and aquaculture[112]         11500
33309   1999    10  Animal production and aquaculture[112]         11500
33412   1999    11  Animal production and aquaculture[112]         14000
33515   1999    12  Animal production and aquaculture[112]         11000

[552 rows x 4 columns]

### Changing all names of the NACIS column to *Farms*

After changing all column names to *Farms*, the dataframe was sorted by the **SYEAR and SMTH** columns. Then, the *Employment* column was segregated to add up consecutives even rows to get the sum of empoyments from both [111] and [112].

After that, the dataframe was merged back and the columns names were changed to reflect *Data Output Template*.

In [17]:
Farms = Farms.replace('Crop production[111]', 'Farms')
Farms = Farms.replace('Animal production and aquaculture[112]', 'Farms')
Farms

       SYEAR  SMTH  NAICS  _EMPLOYMENT_
5491    2000     1  Farms         11250
5593    2000     2  Farms         10250
5695    2000     3  Farms         13500
5797    2000     4  Farms         17000
5899    2000     5  Farms         21000
...      ...   ...    ...           ...
33103   1999     8  Farms         11500
33206   1999     9  Farms         11500
33309   1999    10  Farms         11500
33412   1999    11  Farms         14000
33515   1999    12  Farms         11000

[552 rows x 4 columns]

In [18]:
df1 = Farms.sort_values(['SYEAR', 'SMTH'])
df1.head(50)

       SYEAR  SMTH  NAICS  _EMPLOYMENT_
29923   1997     1  Farms          8750
29910   1997     1  Farms         13500
30026   1997     2  Farms          9750
30013   1997     2  Farms         14000
30129   1997     3  Farms         10500
30116   1997     3  Farms         13250
30232   1997     4  Farms         10500
30219   1997     4  Farms         15000
30335   1997     5  Farms         12000
30322   1997     5  Farms         15500
30438   1997     6  Farms         16500
30425   1997     6  Farms         17250
30541   1997     7  Farms         18750
30528   1997     7  Farms         17500
30644   1997     8  Farms         19250
30631   1997     8  Farms         14500
30747   1997     9  Farms         17250
30734   1997     9  Farms         14750
30850   1997    10  Farms         13500
30837   1997    10  Farms         14750
30953   1997    11  Farms         14500
30940   1997    11  Farms         16000
31056   1997    12  Farms         11000
31043   1997    12  Farms         16750
31159   1998     1  Farms         14500
31146   1998     1  Farms         13500
31262   1998     2  Farms         14250
31249   1998     2  Farms         13000
31365   1998     3  Farms         15500
31352   1998     3  Farms         12750
31468   1998     4  Farms         19500
31455   1998     4  Farms         12500
31571   1998     5  Farms         19750
31558   1998     5  Farms         14250
31674   1998     6  Farms         19500
31661   1998     6  Farms         13750
31777   1998     7  Farms         19750
31764   1998     7  Farms         15250
31880   1998     8  Farms         20250
31867   1998     8  Farms         13250
31983   1998     9  Farms         19750
31970   1998     9  Farms         11500
32086   1998    10  Farms         18250
32073   1998    10  Farms          9750
32189   1998    11  Farms         11500
32176   1998    11  Farms          9500
32292   1998    12  Farms         10500
32279   1998    12  Farms          9250
32395   1999     1  Farms         10750
32382   1999     1  Farms          9750

### Executing all aforementioned steps in one cell

In [19]:
df = df1.drop(['SYEAR', 'SMTH', 'NAICS'], axis = 1)
df

df.index = np.arange(1,len(df)+1)
df = df.reset_index()
df

df = df.set_index('index')
df_odd = df.loc[df.index.values % 2 == 1]
df_even = df.loc[df.index.values % 2 == 0]
df_even = df_even.set_index(df_even.index.values - 1)
new = df_odd.add(df_even, fill_value = 0)
new = new.reset_index().reset_index()
new

df2 = df1[np.arange(len(df)) % 2 == 0]
df2 = df2.reset_index().reset_index()
df2

df3 = pd.merge(df2, new, how = 'inner', on = 'level_0')
df3 = df3.drop(['level_0', 'index_x', '_EMPLOYMENT__x', 'index_y'], axis = 1)
df3.columns = ['SYEAR', 'SMTH', 'LMO_Detailed_Industry', 'Employment']
Farms = df3
Farms.tail(30)

     SYEAR  SMTH LMO_Detailed_Industry  Employment
246   2017     7                 Farms       25000
247   2017     8                 Farms       25500
248   2017     9                 Farms       19750
249   2017    10                 Farms       20750
250   2017    11                 Farms       19500
251   2017    12                 Farms       18000
252   2018     1                 Farms       19250
253   2018     2                 Farms       22000
254   2018     3                 Farms       20250
255   2018     4                 Farms       21750
256   2018     5                 Farms       21250
257   2018     6                 Farms       20500
258   2018     7                 Farms       22500
259   2018     8                 Farms       19750
260   2018     9                 Farms       24500
261   2018    10                 Farms       21750
262   2018    11                 Farms       22000
263   2018    12                 Farms       21000
264   2019     1                 Farms       19250
265   2019     2                 Farms       21000
266   2019     3                 Farms       22250
267   2019     4                 Farms       24750
268   2019     5                 Farms       29000
269   2019     6                 Farms       21750
270   2019     7                 Farms       25250
271   2019     8                 Farms       27500
272   2019     9                 Farms       27750
273   2019    10                 Farms           0
274   2019    11                 Farms           0
275   2019    12                 Farms           0

## Getting *Food, beverage and tobacco manufacturing* from Food manufacturing[311] & Beverage and tobacco product manufacturing[312]

In [20]:
Food_manufacturing = data.loc[data['NAICS'].str.contains('311', na = False)]
Food_manufacturing

       SYEAR  SMTH                    NAICS  _EMPLOYMENT_
5501    2000     1  Food manufacturing[311]         19500
5603    2000     2  Food manufacturing[311]         16000
5705    2000     3  Food manufacturing[311]         14750
5807    2000     4  Food manufacturing[311]         18500
5909    2000     5  Food manufacturing[311]         19750
...      ...   ...                      ...           ...
33126   1999     8  Food manufacturing[311]         19000
33229   1999     9  Food manufacturing[311]         18250
33332   1999    10  Food manufacturing[311]         20000
33435   1999    11  Food manufacturing[311]         17500
33538   1999    12  Food manufacturing[311]         18750

[276 rows x 4 columns]

In [21]:
Beverage_and_tobacco_product_manufacturing = data.loc[data['NAICS'].str.contains('312', na = False)]
Beverage_and_tobacco_product_manufacturing

,SYEAR,SMTH,NAICS,_EMPLOYMENT_
5479,2000,1,Beverage and tobacco product manufacturing[312],3250
5581,2000,2,Beverage and tobacco product manufacturing[312],4250
5683,2000,3,Beverage and tobacco product manufacturing[312],3750
5785,2000,4,Beverage and tobacco product manufacturing[312],4750
5887,2000,5,Beverage and tobacco product manufacturing[312],5000
...,...,...,...,...
33104,1999,8,Beverage and tobacco product manufacturing[312],3250
33207,1999,9,Beverage and tobacco product manufacturing[312],2250
33310,1999,10,Beverage and tobacco product manufacturing[312],2500
33413,1999,11,Beverage and tobacco product manufacturing[312],2000
33516,1999,12,Beverage and tobacco product manufacturing[312],2000

In [22]:
Food_beverage_and_tobacco_manufacturing = pd.concat([Food_manufacturing, Beverage_and_tobacco_product_manufacturing])
Food_beverage_and_tobacco_manufacturing

,SYEAR,SMTH,NAICS,_EMPLOYMENT_
5501,2000,1,Food manufacturing[311],19500
5603,2000,2,Food manufacturing[311],16000
5705,2000,3,Food manufacturing[311],14750
5807,2000,4,Food manufacturing[311],18500
5909,2000,5,Food manufacturing[311],19750
...,...,...,...,...
33104,1999,8,Beverage and tobacco product manufacturing[312],3250
33207,1999,9,Beverage and tobacco product manufacturing[312],2250
33310,1999,10,Beverage and tobacco product manufacturing[312],2500
33413,1999,11,Beverage and tobacco product manufacturing[312],2000
33516,1999,12,Beverage and tobacco product manufacturing[312],2000

### Changing all names of the NACIS column to *Food, beverage and tobacco manufacturing*

After changing all column names to *Food, beverage and tobacco manufacturing*, the dataframe was sorted by the **SYEAR and SMTH** columns. Then, the *Employment* column was segregated to add up consecutives even rows to get the sum of empoyments from both [311] and [312].

After that, the dataframe was merged back and the columns names were changed to reflect *Data Output Template*.

In [23]:
Food_beverage_and_tobacco_manufacturing = Food_beverage_and_tobacco_manufacturing.replace(
    'Food manufacturing[311]', 'Food_beverage_and_tobacco_manufacturing')
Food_beverage_and_tobacco_manufacturing = Food_beverage_and_tobacco_manufacturing.replace(
    'Beverage and tobacco product manufacturing[312]', 'Food_beverage_and_tobacco_manufacturing')
Food_beverage_and_tobacco_manufacturing

       SYEAR  SMTH                                    NAICS  _EMPLOYMENT_
5501    2000     1  Food_beverage_and_tobacco_manufacturing         19500
5603    2000     2  Food_beverage_and_tobacco_manufacturing         16000
5705    2000     3  Food_beverage_and_tobacco_manufacturing         14750
5807    2000     4  Food_beverage_and_tobacco_manufacturing         18500
5909    2000     5  Food_beverage_and_tobacco_manufacturing         19750
...      ...   ...                                      ...           ...
33104   1999     8  Food_beverage_and_tobacco_manufacturing          3250
33207   1999     9  Food_beverage_and_tobacco_manufacturing          2250
33310   1999    10  Food_beverage_and_tobacco_manufacturing          2500
33413   1999    11  Food_beverage_and_tobacco_manufacturing          2000
33516   1999    12  Food_beverage_and_tobacco_manufacturing          2000

[552 rows x 4 columns]

In [24]:
df1 = Food_beverage_and_tobacco_manufacturing.sort_values(['SYEAR', 'SMTH'])
df1.tail(50)

       SYEAR  SMTH                                    NAICS  _EMPLOYMENT_
27408   2017    12  Food_beverage_and_tobacco_manufacturing         21750
27386   2017    12  Food_beverage_and_tobacco_manufacturing          8250
27509   2018     1  Food_beverage_and_tobacco_manufacturing         27000
27487   2018     1  Food_beverage_and_tobacco_manufacturing          8500
27610   2018     2  Food_beverage_and_tobacco_manufacturing         26000
27588   2018     2  Food_beverage_and_tobacco_manufacturing          8500
27711   2018     3  Food_beverage_and_tobacco_manufacturing         28250
27689   2018     3  Food_beverage_and_tobacco_manufacturing          6500
27812   2018     4  Food_beverage_and_tobacco_manufacturing         25000
27790   2018     4  Food_beverage_and_tobacco_manufacturing          8250
27913   2018     5  Food_beverage_and_tobacco_manufacturing         32750
27891   2018     5  Food_beverage_and_tobacco_manufacturing          7000
28014   2018     6  Food_beverage_and_tobacco_manufacturing         32250
27992   2018     6  Food_beverage_and_tobacco_manufacturing          8000
28115   2018     7  Food_beverage_and_tobacco_manufacturing         33500
28093   2018     7  Food_beverage_and_tobacco_manufacturing          7500
28216   2018     8  Food_beverage_and_tobacco_manufacturing         30000
28194   2018     8  Food_beverage_and_tobacco_manufacturing          6250
28317   2018     9  Food_beverage_and_tobacco_manufacturing         29000
28295   2018     9  Food_beverage_and_tobacco_manufacturing          7250
28418   2018    10  Food_beverage_and_tobacco_manufacturing         31750
28396   2018    10  Food_beverage_and_tobacco_manufacturing          5500
28519   2018    11  Food_beverage_and_tobacco_manufacturing         31000
28497   2018    11  Food_beverage_and_tobacco_manufacturing          5000
28620   2018    12  Food_beverage_and_tobacco_manufacturing         29250
28598   2018    12  Food_beverage_and_tobacco_manufacturing          4750
28721   2019     1  Food_beverage_and_tobacco_manufacturing         29000
28699   2019     1  Food_beverage_and_tobacco_manufacturing          5250
28822   2019     2  Food_beverage_and_tobacco_manufacturing         26500
28800   2019     2  Food_beverage_and_tobacco_manufacturing          6750
28923   2019     3  Food_beverage_and_tobacco_manufacturing         26750
28901   2019     3  Food_beverage_and_tobacco_manufacturing          6250
29024   2019     4  Food_beverage_and_tobacco_manufacturing         23500
29002   2019     4  Food_beverage_and_tobacco_manufacturing          8500
29125   2019     5  Food_beverage_and_tobacco_manufacturing         26500
29103   2019     5  Food_beverage_and_tobacco_manufacturing         10250
29226   2019     6  Food_beverage_and_tobacco_manufacturing         24250
29204   2019     6  Food_beverage_and_tobacco_manufacturing          6250
29327   2019     7  Food_beverage_and_tobacco_manufacturing         32750
29305   2019     7  Food_beverage_and_tobacco_manufacturing          6500
29428   2019     8  Food_beverage_and_tobacco_manufacturing         31250
29406   2019     8  Food_beverage_and_tobacco_manufacturing          5000
29529   2019     9  Food_beverage_and_tobacco_manufacturing         28500
29507   2019     9  Food_beverage_and_tobacco_manufacturing          6750
29630   2019    10  Food_beverage_and_tobacco_manufacturing             0
29608   2019    10  Food_beverage_and_tobacco_manufacturing             0
29731   2019    11  Food_beverage_and_tobacco_manufacturing             0
29709   2019    11  Food_beverage_and_tobacco_manufacturing             0
29832   2019    12  Food_beverage_and_tobacco_manufacturing             0
29810   2019    12  Food_beverage_and_tobacco_manufacturing             0

### Executing all aforementioned steps in one cell

In [25]:
df = df1.drop(['SYEAR', 'SMTH', 'NAICS'], axis = 1)
df

df.index = np.arange(1,len(df)+1)
df = df.reset_index()
df

df = df.set_index('index')
df_odd = df.loc[df.index.values % 2 == 1]
df_even = df.loc[df.index.values % 2 == 0]
df_even = df_even.set_index(df_even.index.values - 1)
new = df_odd.add(df_even, fill_value = 0)
new = new.reset_index().reset_index()
new

df2 = df1[np.arange(len(df)) % 2 == 0]
df2 = df2.reset_index().reset_index()
df2

df3 = pd.merge(df2, new, how = 'inner', on = 'level_0')
df3 = df3.drop(['level_0', 'index_x', '_EMPLOYMENT__x', 'index_y'], axis = 1)
df3.columns = ['SYEAR', 'SMTH', 'LMO_Detailed_Industry', 'Employment']
Farms = df3
Farms.tail(30)

     SYEAR  SMTH                    LMO_Detailed_Industry  Employment
246   2017     7  Food_beverage_and_tobacco_manufacturing       30250
247   2017     8  Food_beverage_and_tobacco_manufacturing       30000
248   2017     9  Food_beverage_and_tobacco_manufacturing       31250
249   2017    10  Food_beverage_and_tobacco_manufacturing       27500
250   2017    11  Food_beverage_and_tobacco_manufacturing       23000
251   2017    12  Food_beverage_and_tobacco_manufacturing       30000
252   2018     1  Food_beverage_and_tobacco_manufacturing       35500
253   2018     2  Food_beverage_and_tobacco_manufacturing       34500
254   2018     3  Food_beverage_and_tobacco_manufacturing       34750
255   2018     4  Food_beverage_and_tobacco_manufacturing       33250
256   2018     5  Food_beverage_and_tobacco_manufacturing       39750
257   2018     6  Food_beverage_and_tobacco_manufacturing       40250
258   2018     7  Food_beverage_and_tobacco_manufacturing       41000
259   2018     8  Food_beverage_and_tobacco_manufacturing       36250
260   2018     9  Food_beverage_and_tobacco_manufacturing       36250
261   2018    10  Food_beverage_and_tobacco_manufacturing       37250
262   2018    11  Food_beverage_and_tobacco_manufacturing       36000
263   2018    12  Food_beverage_and_tobacco_manufacturing       34000
264   2019     1  Food_beverage_and_tobacco_manufacturing       34250
265   2019     2  Food_beverage_and_tobacco_manufacturing       33250
266   2019     3  Food_beverage_and_tobacco_manufacturing       33000
267   2019     4  Food_beverage_and_tobacco_manufacturing       32000
268   2019     5  Food_beverage_and_tobacco_manufacturing       36750
269   2019     6  Food_beverage_and_tobacco_manufacturing       30500
270   2019     7  Food_beverage_and_tobacco_manufacturing       39250
271   2019     8  Food_beverage_and_tobacco_manufacturing       36250
272   2019     9  Food_beverage_and_tobacco_manufacturing       35250
273   2019    10  Food_beverage_and_tobacco_manufacturing           0
274   2019    11  Food_beverage_and_tobacco_manufacturing           0
275   2019    12  Food_beverage_and_tobacco_manufacturing           0

## Getting *Business, building and other support services* from Management of companies and enterprises[55] & Beverage and tobacco product manufacturing[56]

The whole process was repeated to obatin the *Business, building and other support services*. After changing all column names to *Business, building and other support services*, the dataframe was sorted by the **SYEAR and SMTH** columns. Then, the *Employment* column was segregated to add up consecutives even rows to get the sum of empoyments from both [55] and [56].

After that, the dataframe was merged back and the columns names were changed to reflect *Data Output Template*.

In [31]:
facturing = data.loc[data['NAICS'].str.contains('55', regex = True, na = False)]
facturing

       SYEAR  SMTH                                         NAICS  _EMPLOYMENT_
9       2000     1  Management of companies and enterprises [55]          1000
29      2000     2  Management of companies and enterprises [55]          1500
49      2000     3  Management of companies and enterprises [55]          1500
69      2000     4  Management of companies and enterprises [55]          1000
89      2000     5  Management of companies and enterprises [55]          1000
...      ...   ...                                           ...           ...
33146   1999     8  Management of companies and enterprises[551]           750
33249   1999     9  Management of companies and enterprises[551]           500
33352   1999    10  Management of companies and enterprises[551]          1000
33455   1999    11  Management of companies and enterprises[551]          1500
33558   1999    12  Management of companies and enterprises[551]          1250

[456 rows x 4 columns]